const ERROR_MESSAGES = {
    401: "Чтобы воспользоваться сервисом, пожалуйста, авторизуйтесь.",
    403: "Нет доступа!",
    404: "Такая задача в базе данных не найдена, попробуйте обновить страницу!",
    500: "Произошла непредвиденная ошибка сервера. Пожалуйста, повторите попытку позже.",
    GENERIC_ERROR: "Что-то пошло не так, пожалуйста, повторите попытку позже.",
    NETWORK_ERROR:
        "Сетевая ошибка, не удается связаться с сервером. Пожалуйста, проверьте ваше соединение.",
};

export default ERROR_MESSAGES;
